{"class_name": "Sequential", "config": [{"class_name": "BatchNormalization", "config": {"name": "batchnormalization_1", "mode": 0, "input_dtype": "float32", "trainable": true, "epsilon": 0.001, "batch_input_shape": [null, 48, 160, 3], "beta_regularizer": null, "axis": -1, "gamma_regularizer": null, "momentum": 0.99}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_1", "b_constraint": null, "activation": "relu", "trainable": true, "nb_filter": 16, "activity_regularizer": null, "W_constraint": null, "nb_col": 3, "b_regularizer": null, "subsample": [1, 1], "border_mode": "valid", "init": "glorot_uniform", "nb_row": 3, "bias": true, "dim_ordering": "tf", "W_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_1", "border_mode": "valid", "pool_size": [2, 2], "trainable": true, "dim_ordering": "tf", "strides": [2, 2]}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_2", "b_constraint": null, "activation": "relu", "trainable": true, "nb_filter": 24, "activity_regularizer": null, "W_constraint": null, "nb_col": 3, "b_regularizer": null, "subsample": [1, 1], "border_mode": "valid", "init": "glorot_uniform", "nb_row": 3, "bias": true, "dim_ordering": "tf", "W_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_2", "border_mode": "valid", "pool_size": [2, 2], "trainable": true, "dim_ordering": "tf", "strides": [2, 2]}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_3", "b_constraint": null, "activation": "relu", "trainable": true, "nb_filter": 36, "activity_regularizer": null, "W_constraint": null, "nb_col": 3, "b_regularizer": null, "subsample": [1, 1], "border_mode": "valid", "init": "glorot_uniform", "nb_row": 3, "bias": true, "dim_ordering": "tf", "W_regularizer": null}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_4", "b_constraint": null, "activation": "relu", "trainable": true, "nb_filter": 48, "activity_regularizer": null, "W_constraint": null, "nb_col": 2, "b_regularizer": null, "subsample": [1, 1], "border_mode": "valid", "init": "glorot_uniform", "nb_row": 2, "bias": true, "dim_ordering": "tf", "W_regularizer": null}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_5", "b_constraint": null, "activation": "relu", "trainable": true, "nb_filter": 48, "activity_regularizer": null, "W_constraint": null, "nb_col": 2, "b_regularizer": null, "subsample": [1, 1], "border_mode": "valid", "init": "glorot_uniform", "nb_row": 2, "bias": true, "dim_ordering": "tf", "W_regularizer": null}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_1", "output_dim": 512, "activation": "relu", "W_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "trainable": true, "bias": true, "input_dim": 9792}}, {"class_name": "Dense", "config": {"name": "dense_2", "output_dim": 10, "activation": "relu", "W_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "trainable": true, "bias": true, "input_dim": 512}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "p": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_3", "output_dim": 2, "activation": "softmax", "W_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "trainable": true, "bias": true, "input_dim": 10}}], "keras_version": "1.2.2"}